Autodesk.Revit.DB.StructuralConnectionTestUtil.SameFamilyAndFabricationShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Boolean@)
Compares family geometry and fabrication geometry of family instance
by cutting in the center with a plane and comparing edge curves.
Only cut boundary is analysed and compared.
Returns ERR_SUCCESS if comparison was successful or ERR_NOT_APPLICABLE if no fabrication shape.
document:
The document.
elemId:
The elementId of element.
sameShape:
Indicates whether family and fabrication shape are the same.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
this operation failed.
Since:
2018

Autodesk.Revit.DB.StructuralConnectionTestUtil.HasFabricationShape(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns true if element has fabrication geometry for fine detail level
document:
The document.
elemId:
The elementId of element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.StructuralConnectionTestUtil
This class provides test utilities for structural connection.
Since:
2018